import 'package:flutter/material.dart';
import 'package:rasipibook/detail_page.dart';

class FavePage extends StatelessWidget {  @override
  Widget build(BuildContext context) {
   return Scaffold(
     appBar: AppBar(
       backgroundColor: Colors.amber,
       title: Text('Nastha bana ki vegi',style: TextStyle(fontSize: 20,),),
     ),
     body: SingleChildScrollView(
       child: Column(
         children: [
           Padding(
               padding: EdgeInsets.all(11),
             child: TextField(
               decoration: InputDecoration(
                 hintText: 'sarch',
                 enabledBorder: OutlineInputBorder(
                   borderRadius: BorderRadius.circular(20)
                 )
               ),
             ),
           ),
           Row(
             children: [
               Container(
                 margin: EdgeInsets.all(11),
                 width: 110,
                 child: Image.asset('assets/images/H/sweeta/palak ka pakoda.jpg'),
               ),
               Container(
                 child: TextButton(onPressed: (){
                   Navigator.push(context, MaterialPageRoute(builder: (_)=>Detail_page(text: 'पालक  का पकोड़ा'
                       'सामग्री:2 कप ताजे पालक के पत्ते (धोकर और सुखाए हुए)1 कप बेसन (चने का आटा)1/2 कप सूजी (सेमोलिना) (वैकल्पिक, पकौड़े को और कुरकुरा बनाने के लिए)1 प्याज (बारीक कटा हुआ)1 हरी मिर्च (बारीक कटी हुई)1 इंच अदरक (कसा हुआ)1/2 चम्मच जीरा1/2 चम्मच सरसों के बीज1/2 चम्मच अजवाइन1/4 चम्मच हल्दी पाउडर1/2 चम्मच लाल मिर्च पाउडर1/2 चम्मच धनिया पाउडर1/4 चम्मच बेकिंग सोडा (वैकल्पिक)नमक स्वाद अनुसारतेल (तलने के लिए)विधि:पालक की तैयारी:पालक के पत्तों को अच्छे से धोकर पानी से निकाल लें। फिर उन्हें काट लें या तोड़े लें।बैटर तैयार करें:एक बड़े बाउल में बेसन और सूजी डालें।इसमें बारीक कटी हुई प्याज, हरी मिर्च, कसा हुआ अदरक, जीरा, सरसों के बीज, अजवाइन, हल्दी पाउडर, लाल मिर्च पाउडर, धनिया पाउडर, और नमक डालें।थोड़ा पानी डालकर एक गाढ़ा बैटर तैयार करें। बैटर में यदि आप बेकिंग सोडा डालना चाहते हैं तो डालें।पालक डालें:तैयार बैटर में काटे हुए पालक के पत्ते डालें और अच्छे से मिला लें ताकि सभी पालक के पत्ते बैटर में कोट हो जाएं।तेल गरम करें:एक कढ़ाई में पर्याप्त तेल गरम करें। तेल को मध्यम आंच पर गरम करें ताकि पकौड़े कुरकुरे बनें।पकौड़े तलें:गरम तेल में एक-एक चमच भरकर बैटर में डूबी हुई पालक डालें।ध्यान रखें कि पकौड़े आपस में चिपकें नहीं।पकौड़ों को मध्यम आंच पर तलें ताकि वे अंदर से भी पक जाएं और बाहर से कुरकुरे हो जाएं।पकौड़े निकालें:पकौड़े को सुनहरा और कुरकुरा होने पर निकालकर किचन पेपर पर रखें ताकि अतिरिक्त तेल सोख लिया जाए।', image:'assets/images/H/sweeta/palak ka pakoda.jpg')));
                 },child: Text('बारेद का पकोड़ा',style: TextStyle(fontSize: 20,color: Colors.black),),),
               ),


             ],
           ),
           Row(
             children: [
               Container(
                 margin: EdgeInsets.all(11),
                 width: 120,
                 child: Image.asset('assets/images/H/sweeta/poha.png'),
               ),
               Container(
                 child: TextButton(onPressed: (){
                   Navigator.push(context, MaterialPageRoute(builder: (_)=>Detail_page(text: 'पोहा बनाने की विधि'
                       'सामग्री:'
                      ' 1 कप चिउड़े (पोहे)'
                     '  1 प्याज (बारीक कटा हुआ)'
                      ' 1 हरी मिर्च (बारीक कटी हुई)'
                   '1/2 कप उबली हुई आलू (क्यूब्स में कटी हुई)'
                  ' 1/4 कप मूँगफली (भुनी हुई)'
                  ' 1/2 चम्मच सरसों के बीज'
                  ' 1/2 चम्मच जीरा'
                 '  1/4 चम्मच हल्दी पाउडर'
                  ' 1/2 चम्मच गरम मसाला'
                   '1/2 चम्मच चीनी (वैकल्पिक)'
                  ' 1/2 नींबू का रस'
                  ' 2 टेबलस्पून तेल'
                  ' नमक स्वाद अनुसार'
                 '  हरा धनिया (कटा हुआ, सजाने के लिए)'
                     '  कटी हुई हरी मिर्च (सजाने के लिए, वैकल्पिक)'
                       'पत्तागोभी, गाजर, या मटर (वैकल्पिक, स्वाद अनुसार)'
                 '  विधि:'
                   'चिउड़े (पोहे) की तैयारी:'

                 '  चिउड़े को एक बाउल में डालें और थोड़े से पानी से धोएं। ध्यान दें कि चिउड़े में पानी ज्यादा न डालें; बस जल्दी से धोकर छान लें।'
                '   चिउड़े को छानकर अलग रख दें।'
                  ' मसाले तैयार करें:'

                   'एक कढ़ाई या पैन में तेल गरम करें।'
                   'गरम तेल में सरसों के बीज और जीरा डालें। जब बीज चटकने लगें, तब प्याज डालें और सुनहरा होने तक भूनें।'
                  ' हरी मिर्च और उबले हुए आलू डालें और थोड़ी देर भूनें।'
                   'अब हल्दी पाउडर, गरम मसाला, और नमक डालें। अच्छी तरह मिला लें।'
                 '  चिउड़े डालें:'

                   'तैयार मसाले में चिउड़े डालें और अच्छे से मिला लें ताकि सभी चिउड़े मसाले केयदि आप चीनी  साथ कोट हो जाएं।'
                  ' का उपयोग कर रहे हैं, तो इसे भी इस समय डालें। यह एक हल्का मीठा स्वाद देगा, जो पोहा के स्वाद को और बढ़ा देता है।'
                 '  पकाएँ:'

                  ' चिउड़ों को 2-3 मिनट तक ढक कर पकाएं ताकि वे अच्छी तरह से गर्म हो जाएं और मसाले का स्वाद सोख लें।'
                   'ध्यान दें कि चिउड़े अधिक समय तक पकाने से टेढ़े हो सकते हैं।'
                  ' अंतिम चरण:'

                  ' गैस बंद करें और नींबू का रस डालें।'
                  ' हरा धनिया और मूँगफली डालें।'
                   , image: 'assets/images/H/sweeta/poha.png')));
                 },child: Text('पोहा बनाने की विधि',style: TextStyle(fontSize: 20,color: Colors.black),),),
               )
             ],
           ),
           Row(
             children: [
               Container(
                 margin: EdgeInsets.all(11),
                 width: 130,
                 child: Image.asset('assets/images/H/sweeta/basana ka bada.png'),

               ),
               Container(
                 child: TextButton(onPressed: (){
                   Navigator.push(context, MaterialPageRoute(builder: (_)=>Center(child: Detail_page(text: ' पकोड़ा बनाने की विधि''सामग्री:''  1 कप चना दाल (या मूंग दाल, उबली हुई और भीगी हुई)''  1 हरी मिर्च (बारीक कटी हुई)''1 इंच अदरक (कसा हुआ)''  1/2 कप हरा धनिया (कटा हुआ)'' 1/2 कप प्याज (बारीक कटा हुआ)'' 1/4 कप गाजर (कद्दूकस की हुई, वैकल्पिक)''  1/2 चम्मच जीरा''  1/2 चम्मच सरसों के बीज'' 1/2 चम्मच हल्दी पाउडर''1/2 चम्मच लाल मिर्च पाउडर''नमक स्वाद अनुसार''1/4 चम्मच बेकिंग सोडा (वैकल्पिक)'' तेल (तलने के लिए)''  विधि:'' दाल तैयार करें: चना दाल (या मूंग दाल) को 2-3 घंटे के लिए पानी में भिगो दें। फिर पानी को छानकर दाल को एक मिक्सर में डालें और थोड़ा सा पानी डालकर एक गाढ़ा पेस्ट बना लें। पेस्ट बहुत पतला न बनाएं, यह गाढ़ा और ठोस होना चाहिए।''  मसाले मिलाएं: दाल के पेस्ट में हरी मिर्च, अदरक, हरा धनिया, प्याज, गाजर (यदि उपयोग कर रहे हैं), जीरा, सरसों के बीज, हल्दी पाउडर, लाल मिर्च पाउडर, और नमक डालें। सब चीजों को अच्छे से मिला लें। अगर आप चाहते हैं कि पकौड़े हल्के और कुरकुरे हों, तो बेकिंग सोडा भी डाल सकते हैं।'' तेल गरम करें: एक कढ़ाई में पर्याप्त तेल गरम करें। तेल को मध्यम आंच पर गर्म करें ताकि पकौड़े अच्छे से तले जा सकें।'' पकौड़े तलें: गरम तेल में एक-एक चमच भरकर दाल का मिश्रण डालें। ध्यान रखें कि पकौड़े एक-दूसरे से चिपकें नहीं। पकौड़ों को मध्यम आंच पर तलें ताकि वे अंदर से भी अच्छे से पक जाएं और बाहर से कुरकुरे हो जाएं।' ,image: 'assets/images/H/sweeta/basana ka bada.png',))));
                 },child: Text(' पकोड़ा बनाने की विधि ',style: TextStyle(fontSize: 20,color: Colors.black),),),
               )
             ],
           ),
           Row(
             children: [
               Container(
                 margin: EdgeInsets.all(11),
                 width: 140,
                 child: Image.asset('assets/images/H/sweeta/mirchi.jpg'),
               ),
               Container(
                 child: TextButton(onPressed: (){
                   Navigator.push(context, MaterialPageRoute(builder: (_)=>Detail_page(text: 'मिर्ची बड़ा''सामग्री:''10-12 हरी मिर्च (मध्यम आकार की, हल्की तीखी)''  1 कप बेसन (चने का आटा)'' 1/2 कप दही''1/2 चम्मच अजवाइन'' 1/2 चम्मच हिंग (असफोटीडा)'' 1/2 चम्मच हल्दी पाउडर'' 1/2 चम्मच लाल मिर्च पाउडर''  1/2 चम्मच धनिया पाउडर'' 1/2 चम्मच बेकिंग सोडा (वैकल्पिक)''  नमक स्वाद अनुसार'' तेल (तलने के लिए)'' विधि:'' मिर्च की तैयारी: हरी मिर्चों को अच्छे से धोकर सूखा लें। फिर उनके दोनों सिरे काट दें और अगर बहुत तीखी हैं, तो आप थोड़ी सी बीज भी निकाल सकते हैं।'' बेसन का बैटर तैयार करें:'' एक बड़े बाउल में बेसन डालें।''  दही डालें और अच्छे से मिला लें।''इसमें अजवाइन, हिंग, हल्दी पाउडर, लाल मिर्च पाउडर, धनिया पाउडर, और नमक डालें।''  अच्छे से मिलाकर एक गाढ़ा बैटर तैयार करें। यदि बैटर बहुत गाढ़ा लगे तो थोड़ा सा पानी डाल सकते हैं, लेकिन ध्यान रखें कि बैटर बहुत पतला न हो।''तेल गर्म करें: एक कढ़ाई में तेल गरम करें। तेल को मध्यम आंच पर गरम करें ताकि पकौड़े कुरकुरे बनें।''    मिर्चों को बैटर में डुबोएं: हरी मिर्चों को तैयार बैटर में डुबोएं और अच्छे से कोट कर लें।''पकौड़े तलें: गरम तेल में एक-एक करके बैटर में डूबी हुई मिर्च डालें। ध्यान दें कि मिर्च आपस में चिपकें नहीं। पकौड़ों को मध्यम आंच पर तलें ताकि वे अंदर से भी पक जाएं और बाहर से कुरकुरे हो जाएं।''पकौड़े निकालें: पकौड़े को सुनहरा और कुरकुरा होने पर निकालकर किचन पेपर पर रखें ताकि अतिरिक्त तेल सोख लिया जाए।', image: 'assets/images/H/sweeta/mirchi.jpg')));
                 },child: Text('मिर्ची बड़ा',style: TextStyle(fontSize: 20,color: Colors.black),),),
               )
             ],
           ),

         ],
       ),
     ),
   );
  }
}
